

"""
Користувач має пошту у домені @kpi.ua. Він купляє товари вказуючи назву та ціну.

Формати даних:

    пошта: перша літера англійської абетки у нижньому регістрі, далі стоїть крапка потім прізвище студента.

    назва товару : не більше 10 літер англійської абетки у нижньому регістрі

    ціна товару: додатне дійсне число з двома знаками після десяткової коми

"""


#    Сформувати структуру датасету для дного користувача.


dataset = \
{'222-4444':
     {
         "10.12.2018": {
             'cheese': 1
         },
         '12.12.2018':
             {
                 'coffee': 1
             }
     }
}










